JimKueneman/OpenLcbCLib/src/applications/dspic/OpenLcb_Basic_Node.X/main.c
    Ecan1Helper_initialize();
    BasicNodeDrivers_initialize();

    printf("MCU Initialized\n");

    CanBufferStore_initialize();
    CanBufferFifo_initialize();

    CanRxMessageHandler_initialize(&interface_can_rx_message_handler);
    CanRxStatemachine_initialize(&interface_can_rx_statemachine);

    CanTxMessageHandler_initialize(&interface_can_tx_message_handler);
    CanTxStatemachine_initialize(&interface_can_tx_statemachine);

    CanLoginMessageHandler_initialize(&interface_can_login_message_handler);
    CanLoginStateMachine_initialize(&interface_can_login_state_machine);
    CanMainStatemachine_initialize(&interface_can_main_statemachine);

    AliasMappings_initialize();

    OpenLcbBufferStore_initialize();
    OpenLcbBufferList_initialize();
    OpenLcbBufferFifo_initialize();

    ProtocolSnip_initialize(&interface_openlcb_protocol_snip);
    ProtocolDatagramConfigMemHandler_initialize(&interface_openlcb_protocol_datagram_config_mem_handler);
    ProtocolDatagramHandler_initialize(&interface_protocol_datagram_handler);
    ProtocolEventTransport_initialize(&interface_openlcb_protocol_event_transport);
    ProtocolMessageNetwork_initialize(&interface_openlcb_protocol_message_network);

    OpenLcbNode_initialize(&interface_openlcb_node);

    OpenLcbLoginMessageHandler_initialize(&interface_openlcb_login_message_handler);
    OpenLcbLoginStateMachine_initialize(&interface_openlcb_login_state_machine);
    OpenLcbMainStatemachine_initialize(&interface_openlcb_main_statemachine);

    OpenLcbApplication_initialize(&interface_openlcb_application);

    // We always boot and reallocate the alias
    openlcb_node_t* node = OpenLcbNode_allocate(0x050101010707, &NodeParameters_main_node);

    printf("Does it work?\n");

    while (1) {

        // Run the main Openlcb/LCC engine
        CanMainStateMachine_run();
        OpenLcbMainStatemachine_run();

    }
}
